In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv(r"C:\Users\uzuma\Downloads\age_of_marriage_data.csv")

In [3]:
df

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0
...,...,...,...,...,...,...,...,...,...,...
2562,2563,female,"5'3""",Hindu,Thakur,Hindi,Banking Professional,Agra,India,27.0
2563,2564,male,"5'11""",Hindu,Thakur,Hindi,Software Professional,Ottawa,Canada,31.0
2564,2565,female,"5'3""",Hindu,Baishya,Bengali,Software Consultant,Bengaluru / Bangalore,India,28.0
2565,2566,female,"4'11""",NaN,others,Telugu,Not working,Hyderabad,India,26.0
2566,2567,female,"5'2""",Christian,Marthoma,Malayalam,Software Professional,Pune,India,32.0

In [4]:
df.describe()

                id  age_of_marriage
count  2567.000000      2548.000000
mean   1284.000000        29.648352
std     741.173394         2.802414
min       1.000000        20.000000
25%     642.500000        28.000000
50%    1284.000000        30.000000
75%    1925.500000        32.000000
max    2567.000000        36.000000

In [5]:
df.isna().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage     19
dtype: int64

In [6]:
df["gender"]=df["gender"].ffill()

In [7]:
df["gender"]

0       female
1         male
2         male
3       female
4         male
         ...
2562    female
2563      male
2564    female
2565    female
2566    female
Name: gender, Length: 2567, dtype: object

In [8]:
df["gender"].isna().sum()

0

In [9]:
import re

In [10]:
df["height"]

0        5'4"
1        5'7"
2        5'7"
3        5'0"
4        5'5"
        ...
2562     5'3"
2563    5'11"
2564     5'3"
2565    4'11"
2566     5'2"
Name: height, Length: 2567, dtype: object

In [11]:
df["height"]=df["height"].ffill()

In [12]:
df["height"]=df['height'].astype(str).str.replace("'",'.')

In [13]:
df["height"]=df['height'].astype(str).str.replace('"','')

In [14]:
df["height"]

0        5.4
1        5.7
2        5.7
3        5.0
4        5.5
        ...
2562     5.3
2563    5.11
2564     5.3
2565    4.11
2566     5.2
Name: height, Length: 2567, dtype: object

In [15]:
df["religion"]

0             NaN
1            Jain
2           Hindu
3           Hindu
4       Christian
          ...
2562        Hindu
2563        Hindu
2564        Hindu
2565          NaN
2566    Christian
Name: religion, Length: 2567, dtype: object

In [16]:
df["religion"]=df["religion"].bfill()

In [17]:
df["religion"]

0            Jain
1            Jain
2           Hindu
3           Hindu
4       Christian
          ...
2562        Hindu
2563        Hindu
2564        Hindu
2565    Christian
2566    Christian
Name: religion, Length: 2567, dtype: object

In [18]:
df["religion"].isna().sum()

0

In [19]:
df["caste"]

0            others
1        Shwetamber
2           Brahmin
3            Thakur
4        Born Again
           ...
2562         Thakur
2563         Thakur
2564        Baishya
2565         others
2566       Marthoma
Name: caste, Length: 2567, dtype: object

In [20]:
df["caste"]=df["caste"].ffill()

In [21]:
df["caste"].isna().sum()

0

In [22]:
df["mother_tongue"]

0          Telugu
1        Gujarati
2           Hindi
3           Hindi
4       Malayalam
          ...
2562        Hindi
2563        Hindi
2564      Bengali
2565       Telugu
2566    Malayalam
Name: mother_tongue, Length: 2567, dtype: object

In [23]:
df["mother_tongue"]=df["mother_tongue"].ffill()

In [24]:
df["mother_tongue"].isna().sum()

0

In [25]:
df["profession"]

0                                    NaN
1       Doctor / Healthcare Professional
2              Entrepreneurs / Business
3                              Architect
4         Sales Professional / Marketing
                      ...
2562                Banking Professional
2563               Software Professional
2564                 Software Consultant
2565                         Not working
2566               Software Professional
Name: profession, Length: 2567, dtype: object

In [26]:
df["profession"]=df["profession"].bfill()

In [27]:
df["profession"].isna().sum()

0

In [28]:
df["location"]

0                      London
1                 Fairfax- VA
2                   Begusarai
3                      Mumbai
4             Sulthan Bathery
                ...
2562                     Agra
2563                   Ottawa
2564    Bengaluru / Bangalore
2565                Hyderabad
2566                     Pune
Name: location, Length: 2567, dtype: object

In [29]:
df["location"]=df["location"].ffill()

In [30]:
df["location"].isna().sum()

0

In [31]:
df["country"]

0        United Kingdom
1                   USA
2                 India
3                 India
4                 India
             ...
2562              India
2563             Canada
2564              India
2565              India
2566              India
Name: country, Length: 2567, dtype: object

In [32]:
df["country"]=df["country"].ffill()

In [33]:
df["country"].isna().sum()

0

In [34]:
df["age_of_marriage"]

0       21.0
1       32.0
2       32.0
3       30.0
4       30.0
        ...
2562    27.0
2563    31.0
2564    28.0
2565    26.0
2566    32.0
Name: age_of_marriage, Length: 2567, dtype: float64

In [35]:
df["age_of_marriage"]=df["age_of_marriage"].ffill()

In [36]:
df["age_of_marriage"].isna().sum()

0

In [37]:
mini=df["age_of_marriage"].min()
Q1=df["age_of_marriage"].quantile(0.25)
Q2=df["age_of_marriage"].quantile(0.50)
Q3=df["age_of_marriage"].quantile(0.75)
Max=df["age_of_marriage"].max()
 
IQR=Q3-Q1
Upper_fence=Q3+(1.5*IQR)
Lower_fence=Q1-(1.5*IQR)

In [38]:
print("Upper-",Upper_fence)
print("Lower-",Lower_fence)

Upper- 38.0
Lower- 22.0

In [39]:
df[df["age_of_marriage"]<Lower_fence]

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,5.4,Jain,others,Telugu,Doctor / Healthcare Professional,London,United Kingdom,21.0
21,22,female,4.5,Hindu,others,Bengali,Not working,Midnapore,India,20.0
157,158,female,5.3,Hindu,others,Bengali,Mechanical / Production Engineer,Midnapore,India,20.0
373,374,female,4.5,Hindu,others,Hindi,Not Specified,Bihar Sharif,India,21.0
539,540,male,5.3,Hindu,others,Telugu,Admin Professional,Chennai,India,21.0
781,782,male,5.0,Hindu,others,Tamil,Mechanical / Production Engineer,Pilibhit,India,21.0
852,853,male,4.5,Hindu,others,Hindi,Medical / Healthcare Professional (Others),Haveri,India,21.0
856,857,male,5.11,Sikh,others,Hindi,Actor,Bihar Sharif,India,21.0
1029,1030,female,5.8,Hindu,others,Marathi,Dentist,Akola,India,21.0
1066,1067,female,5.4,Jain,others,Telugu,Managers and Senior Executives,Mumbai,India,20.0
1098,1099,female,4.11,Hindu,others,Marathi,Banking Professional,Jalgaon,India,20.0
1129,1130,female,5.4,Hindu,others,Bengali,Not working,Bardhaman,India,21.0
1146,1147,male,4.5,Hindu,Lingayath,Hindi,Not working,Pali,India,21.0
1189,1190,male,4.9,Hindu,others,Bengali,Banking Professional,Bengaluru / Bangalore,India,21.0
1247,1248,female,5.3,Hindu,others,Hindi,Not working,Raipur,India,21.0
1353,1354,male,6.5,Hindu,others,Hindi,Not working,Jodhpur,India,21.0
1408,1409,male,5.0,Christian,others,Tamil,Agricultural Professional (Others),Dharmapuri,India,21.0
1573,1574,female,5.6,Hindu,others,Hindi,Banking Professional,Muzaffarnagar,India,20.0
1697,1698,female,5.3,Hindu,others,Hindi,Doctor / Healthcare Professional,Karauli,India,20.0
1766,1767,male,5.1,Hindu,Kayastha,Hindi,Finance Professional,Midnapore,India,21.0
1923,1924,female,5.4,Hindu,others,Hindi,Writer,Howra,India,21.0
1931,1932,female,5.3,Sikh,Bhandari,Marathi,Teacher,Ahmedabad,India,20.0
2023,2024,male,4.5,Hindu,others,Tamil,Admin Professional,Chennai,India,21.0
2222,2223,male,4.6,Hindu,others,Hindi,Sales Professional / Marketing,Sitamarhi,India,21.0
2227,2228,female,5.5,Jain,others,Malayalam,Not Specified,Abu Dhabi,United Arab Emirates,20.0
2398,2399,male,6.0,Hindu,others,Tamil,Managers and Senior Executives,Coimbatore,India,21.0
2405,2406,male,4.11,Sikh,others,Hindi,Not Specified,Vadodara,India,21.0

In [40]:
df.loc[df["age_of_marriage"]<Lower_fence,"age_of_marriage"]=30

In [41]:
df[df["age_of_marriage"]<Lower_fence]

Empty DataFrame
Columns: [id, gender, height, religion, caste, mother_tongue, profession, location, country, age_of_marriage]
Index: []

In [42]:
df.isna().sum()

id                 0
gender             0
height             0
religion           0
caste              0
mother_tongue      0
profession         0
location           0
country            0
age_of_marriage    0
dtype: int64